---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LinkFailures.SourceFileDrivenByOtherTarget
source: html/f426e161-8942-738c-f012-03da68cda6b9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LinkFailures.SourceFileDrivenByOtherTarget Property

Linked Model's Shared Coordinates have been modified via another host model in this session. In order to be able to change the Linked File via the active host model, Save and open it again in a new session.

## Syntax (C#)
```csharp
public static FailureDefinitionId SourceFileDrivenByOtherTarget { get; }
```